a5021/STM32F401CCU6-Blink-Bare-Metal/main.h
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/*=============================================================================
 * This project uses a functional-register style: register fields are written
 * as self-documenting expressions (e.g. 1 * RCC_AHB1ENR_GPIOAEN) rather than
 * opaque hex values.  "0 * ..." means the bit is disabled (ORed with zero),
 * "1 * ..." means the bit is enabled.
 *============================================================================*/

#include <stdio.h>
#include "stm32f4xx.h"

/*---------------------------------------------------------------------------
 * GPIO helpers
 *---------------------------------------------------------------------------*/

#define ALL_ANALOG            UINT32_MAX
#define PIN_CONF(PIN, MODE)   ((MODE) << ((PIN) * 2))
#define PIN_AF(PIN, AF)       ((AF) << (4 * (PIN)))

#define PIN(PIN_NO)           (PIN_NO)
#define AF(PIN_NO)            (PIN_NO ## ULL)

#define PIN_MODE_INPUT        0UL
#define PIN_MODE_OUTPUT       1UL
#define PIN_MODE_ALT_FUNC     2UL
#define PIN_MODE_ANALOG       3UL

#define PINV_INPUT            3UL
#define PINV_OUTPUT           2UL
#define PINV_ALT_FUNC         1UL
#define PINV_ANALOG           0UL

#define PIN_SPEED_LOW         0UL
#define PIN_SPEED_MEDIUM      1UL
#define PIN_SPEED_HIGH        2UL
#define PIN_SPEED_HIGHER      3UL

#define PIN_SPEED(PORT, CFG)  GPIO ## PORT->OSPEEDR = (CFG)

#define PIN_PULL_NO           0UL
#define PIN_PULL_UP           1UL
#define PIN_PULL_DOWN         2UL

#define PIN_LOW(PIN)          GPIO_BSRR_BR_ ## PIN
#define PIN_HIGH(PIN)         GPIO_BSRR_BS_ ## PIN

#define LOW                   GPIO_BSRR_BR_
#define HIGH                  GPIO_BSRR_BS_
#define LO                    0
#define HI                    1

#define PIN_STATE(PIN, STATE) (1 << ((PIN) + (16 * !(STATE))))

#define CAT(A, B)             A ## B
#define SWITCH_PIN(PORT, PIN, STATE) GPIO ## PORT->BSRR = CAT(STATE, PIN)
#define SW_PIN(PORT, STATE)   GPIO ## PORT->BSRR = (STATE)

/*---------------------------------------------------------------------------
 * BCD / RTC helpers
 *---------------------------------------------------------------------------*/

#define BCD2DEC(B)            (((B) & 0x0F) + ((B) >> 4) * 10)
#define DEC2BCD(D)            (((D) % 10) + (((D) / 10) << 4))

#define RTC_DAY(DR)           (DR & 0x3F)
#define RTC_MONTH(DR)         ((DR >> 8) & 0x1F)
#define RTC_YEAR(DR)          (DR >> 16)
#define RTC_HOUR(TR)          ((TR >> 16) & 0x3F)
#define RTC_MINUTE(TR)        ((TR >> 8) & 0x7F)
#define RTC_SECOND(TR)        (TR & 0x7F)

/*---------------------------------------------------------------------------
 * Timing: SysTick-based delay
 *   SysTick runs at AHB/8 = 12.5 MHz; COUNTFLAG is set every 1 ms (LOAD=12499).
 *   DELAY_MS(x) busy-waits for approximately x milliseconds.
 *---------------------------------------------------------------------------*/

#define GET_TICK()            (SysTick->CTRL >> SysTick_CTRL_COUNTFLAG_Pos)
#define DELAY_MS(MS)          do{(void)SysTick->CTRL; for(unsigned _ = MS; _; _ -= GET_TICK()){}}while(0)

#define MHZ                   *1000000UL

/*---------------------------------------------------------------------------
 * UART helpers
 *---------------------------------------------------------------------------*/

#define UART_BAUDRATE(FCLK, P_SPEED)    (((FCLK) + ((P_SPEED)/2U)) / (P_SPEED))

#define READ_UART(_UART_NO, BUF, LEN)                                           \
  for (int i = 0; i < (LEN); i++) {                                             \
     while((USART##_UART_NO->SR & USART_SR_RXNE) != USART_SR_RXNE) { /****/ }   \
     (BUF)[i] = USART##_UART_NO->DR;                                            \
  }                                                                              
                                                                                 
#define WRITE_UART(_UART_NO, SRC, LEN)                                          \
  for (int i = 0; i < LEN; i++) {                                               \
    while((USART##_UART_NO->SR & USART_SR_TXE) != USART_SR_TXE) { /****/ }      \
    USART##_UART_NO->DR = SRC[i];                                               \
  }

__STATIC_INLINE void u_putc(const char c) {
  while ((USART6->SR & USART_SR_TXE) == 0);
  USART6->DR = c;
}

__STATIC_INLINE void u_puts(const char *s) {
  while (*s != 0) u_putc(*s++);
}

#define u_put_x(c)  do { u_putc(((c) < 10) ? (c) + '0' : (c) + '7'); } while(0)
#define u_putx(c)   do { u_put_x((c) >> 4); u_put_x((c) & 0x0F); } while(0)

__STATIC_INLINE void u_put_bcd(const uint8_t bcd) {
  u_putc('0' + (bcd >> 4));
  u_putc('0' + (bcd & 0x0F));
}

  /* MACRO to emulate printf() via UART */
#define uprintf(...) for(char _b[160]; snprintf(_b, sizeof(_b), __VA_ARGS__), u_puts(_b), 0;){}

__STATIC_INLINE void init_sys(void) {

  RCC->AHB1ENR = (
    1 * RCC_AHB1ENR_GPIOAEN          | /*  0x00000001                                            */
    0 * RCC_AHB1ENR_GPIOBEN          | /*  0x00000002                                            */
    1 * RCC_AHB1ENR_GPIOCEN          | /*  0x00000004                                            */
    0 * RCC_AHB1ENR_GPIODEN          | /*  0x00000008                                            */
    0 * RCC_AHB1ENR_GPIOEEN          | /*  0x00000010                                            */
    0 * RCC_AHB1ENR_GPIOHEN          | /*  0x00000080                                            */
    0 * RCC_AHB1ENR_CRCEN            | /*  0x00001000                                            */
    0 * RCC_AHB1ENR_DMA1EN           | /*  0x00200000                                            */
    0 * RCC_AHB1ENR_DMA2EN             /*  0x00400000                                            */
  );

  RCC->APB1ENR = (
    0 * RCC_APB1ENR_TIM2EN           | /*  0x00000001                                            */
    0 * RCC_APB1ENR_TIM3EN           | /*  0x00000002                                            */
    0 * RCC_APB1ENR_TIM4EN           | /*  0x00000004                                            */
    0 * RCC_APB1ENR_TIM5EN           | /*  0x00000008                                            */
    0 * RCC_APB1ENR_WWDGEN           | /*  0x00000800                                            */
    0 * RCC_APB1ENR_SPI2EN           | /*  0x00004000                                            */
    0 * RCC_APB1ENR_SPI3EN           | /*  0x00008000                                            */
    0 * RCC_APB1ENR_USART2EN         | /*  0x00020000                                            */
    0 * RCC_APB1ENR_I2C1EN           | /*  0x00200000                                            */
    0 * RCC_APB1ENR_I2C2EN           | /*  0x00400000                                            */
    0 * RCC_APB1ENR_I2C3EN           | /*  0x00800000                                            */
    1 * RCC_APB1ENR_PWREN              /*  0x10000000                                            */
  );

  RCC->APB2ENR = (
    0 * RCC_APB2ENR_TIM1EN           | /*  0x00000001                                            */
    0 * RCC_APB2ENR_USART1EN         | /*  0x00000010                                            */
    1 * RCC_APB2ENR_USART6EN         | /*  0x00000020                                            */
    0 * RCC_APB2ENR_ADC1EN           | /*  0x00000100                                            */
    0 * RCC_APB2ENR_SDIOEN           | /*  0x00000800                                            */
    0 * RCC_APB2ENR_SPI1EN           | /*  0x00001000                                            */
    0 * RCC_APB2ENR_SPI4EN           | /*  0x00002000                                            */
    0 * RCC_APB2ENR_SYSCFGEN         | /*  0x00004000                                            */
    0 * RCC_APB2ENR_TIM9EN           | /*  0x00010000                                            */
    0 * RCC_APB2ENR_TIM10EN          | /*  0x00020000                                            */
    0 * RCC_APB2ENR_TIM11EN            /*  0x00040000                                            */
  );

  /*  HSE / M * N / P  =  25Mhz / 15 * 120 / 2 = 100Mhz                                          */

  RCC->PLLCFGR = (
                                                                                                 /* 
       PLLM: Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock
            Caution:The software has to set these bits correctly to ensure that the VCO
            input frequency ranges from 1 to 2 MHz. It is recommended to select
            a frequency of 2 MHz to limit PLL jitter. 
       ================================================================================          */

