a5021/STM32F401CCU6-Blink-Bare-Metal/main.h
      1. Write 0xCA into the RTC_WPR register.
      2. Write 0x53 into the RTC_WPR register.                                                   */

  RTC->WPR = 0xCA;
  RTC->WPR = 0x53;                                                                               /*

    To program the initial time and date calendar values, including the time format and the
    prescaler configuration, the following sequence is required:

      1. Set INIT bit to 1 in the RTC_ISR register to enter initialization mode. In this mode, 
         the calendar counter is stopped and its value can be updated.

      2. Poll INITF bit of in the RTC_ISR register. The initialization phase mode is entered 
         when INITF is set to 1. It takes from 1 to 2 RTCCLK clock cycles (due to clock
         synchronization).

      3. To generate a 1 Hz clock for the calendar counter, program first the synchronous
         prescaler factor in RTC_PRER register, and then program the asynchronous prescaler
         factor. Even if only one of the two fields needs to be changed, 2 separate write
         accesses must be performed to the RTC_PRER register.

      4. Load the initial time and date values in the shadow registers (RTC_TR and RTC_DR),
         and configure the time format (12 or 24 hours) through the FMT bit in the RTC_CR
         register.

      5. Exit the initialization mode by clearing the INIT bit. The actual calendar counter 
         value is then automatically loaded and the counting restarts after 4 RTCCLK clock 
         cycles.                                                                                 */

  RTC->ISR = ~RTC_ISR_WUTF;            /* clear WUTF flag, set INIT flag                         */
  while(!(RTC->ISR & RTC_ISR_INITF)) { /*  */ }

  RTC->PRER = UINT8_MAX;               /*  program first the synchronous prescaler factor        */
  RTC->PRER = (                        /*  then program the asynchronous prescaler factor        */
    RTC_PRER_PREDIV_A                | /*    async: 0x007F0000                                   */
    UINT8_MAX                          /*    sync:  0x000000FF                                   */
  );
                                                                                               
  #if 0
    RTC->CALIBR = (                     /* 0x40002818: RTC calibration register, offset: 0x18    */
      0 * RTC_CALIBR_DCS             |  /* (1 << 7)       0x00000080                             */
      0 * RTC_CALIBR_DC                 /* (0x1F << 0)    0x0000001F                             */
    );                              
                                    
    RTC->CALR = (                       /* 0x4000283C: RTC calibration register, offset: 0x3C    */
      0 * RTC_CALR_CALP              |  /* (1 << 15)      0x00008000                             */
      0 * RTC_CALR_CALW8             |  /* (1 << 14)      0x00004000                             */
      0 * RTC_CALR_CALW16            |  /* (1 << 13)      0x00002000                             */
      0 * RTC_CALR_CALM              |  /* (0x1FF << 0)   0x000001FF                             */
      0 * RTC_CALR_CALM_0            |  /* (0x001 << 0)     0x00000001                           */
      0 * RTC_CALR_CALM_1            |  /* (0x002 << 0)     0x00000002                           */
      0 * RTC_CALR_CALM_2            |  /* (0x004 << 0)     0x00000004                           */
      0 * RTC_CALR_CALM_3            |  /* (0x008 << 0)     0x00000008                           */
      0 * RTC_CALR_CALM_4            |  /* (0x010 << 0)     0x00000010                           */
      0 * RTC_CALR_CALM_5            |  /* (0x020 << 0)     0x00000020                           */
      0 * RTC_CALR_CALM_6            |  /* (0x040 << 0)     0x00000040                           */
      0 * RTC_CALR_CALM_7            |  /* (0x080 << 0)     0x00000080                           */
      0 * RTC_CALR_CALM_8               /* (0x100 << 0)     0x00000100                           */
    );
  #endif

  if (!(RTC->ISR & RTC_ISR_INITS)) {
    RTC->TR = 0x222222; 
    RTC->DR = 0x220222;
  }

  RTC->CR = 0;                                                                                   /*

          When the wakeup timer is disabled, wait for WUTWF=1 before enabling it again.          */

  while(!(RTC->ISR & RTC_ISR_WUTWF));
    
  RTC->WUTR = 2047;

  RTC->CR = (
    0 * RTC_CR_COE                   | /*  0x00800000                                            */
                                                                                                 
    0 * RTC_CR_OSEL                  | /*  0x00600000                                            */
    0 * RTC_CR_OSEL_0                | /*    0x00200000                                          */
    0 * RTC_CR_OSEL_1                | /*    0x00400000                                          */
                                                                                                 
    0 * RTC_CR_POL                   | /*  0x00100000                                            */
    1 * RTC_CR_COSEL                 | /*  0x00080000                                            */
    0 * RTC_CR_BKP                   | /*  0x00040000                                            */
    0 * RTC_CR_SUB1H                 | /*  0x00020000                                            */
    0 * RTC_CR_ADD1H                 | /*  0x00010000                                            */
    0 * RTC_CR_TSIE                  | /*  0x00008000                                            */
    0 * RTC_CR_WUTIE                 | /*  0x00004000                                            */
    0 * RTC_CR_ALRBIE                | /*  0x00002000                                            */
    0 * RTC_CR_ALRAIE                | /*  0x00001000                                            */
    0 * RTC_CR_TSE                   | /*  0x00000800                                            */
    1 * RTC_CR_WUTE                  | /*  0x00000400                                            */
    0 * RTC_CR_ALRBE                 | /*  0x00000200                                            */
    0 * RTC_CR_ALRAE                 | /*  0x00000100                                            */
    0 * RTC_CR_DCE                   | /*  0x00000080                                            */
    0 * RTC_CR_FMT                   | /*  0x00000040                                            */
    0 * RTC_CR_BYPSHAD               | /*  0x00000020                                            */
    0 * RTC_CR_REFCKON               | /*  0x00000010                                            */
    0 * RTC_CR_TSEDGE                | /*  0x00000008                                            */
                                                                                                 
